package cn.iocoder.springboot.labs.utils;


import java.util.regex.Pattern;

public enum WebResultCode {
    SUCCESS(0, "成功"),
    //1****公共错误
    CODE_10000(10410000, "程序运行时异常"),
    CODE_10001(10410001, "参数 {0} 为空"),
    CODE_10002(10410002, "参数异常"),
    CODE_10003(10410003, "AES解密失败"),
    CODE_10004(10410004, "操作失败"),
    CODE_10005(10410005, "服务繁忙"),
    // 12*** 时间解析相关错误
    CODE_12001(10420001, "字符串转Date失败"),

    //2****业务错误
    CODE_20000(10420000, "教室排课冲突"),
    CODE_20001(10420001, "讲师排课冲突"),
    CODE_20002(10420002, "课程安排不存在"),
    CODE_20003(10420003, "教室信息不存在"),
    CODE_20004(10420004, "班级学员已满"),
    CODE_20005(10420005, "课程已结束,无法取消"),
    CODE_20006(10420006, "教室信息已存在"),
    CODE_20007(10420007, "导出数据失败"),
    CODE_20008(10420008, "学员已经签到"),
    CODE_20009(10420009, "排期不存在"),
    CODE_20010(10420010, "班级信息不存在"),
    CODE_20011(10420011, "学员约课信息不存在"),
    CODE_20012(10420012, "购课信息不存在"),
    CODE_20013(10420013, "教室存在已发布的排课,无法减小教室容量"),
    CODE_20014(10420014, "班级信息已存在"),
    CODE_20015(10420015, "班级已经结束"),
    CODE_20016(10420016, "无门店数据权限"),
    CODE_20017(10420017, "当前时间不在排课日期范围内"),
    CODE_20018(10420018, "学员还未签到"),
    CODE_20019(10420019, "教室未配置容量"),
    CODE_20020(10420020, "教室存在已发布的排课,无法删除"),
    CODE_20021(10420021, "请勿重复提交"),
    CODE_20022(10420022, "订单已绑定课程"),
    CODE_20023(10420023, "订单未绑定课程"),
    CODE_20024(10420024, "修改失败，课程已开始"),
    CODE_20025(10420025, "修改失败，课程已结束"),
    CODE_20026(10420026, "门店不存在"),
    CODE_20027(10420027, "门店位置信息不存在"),
    CODE_20028(10420028, "所在位置不在门店附近"),
    CODE_20029(10420029, "班级信息导出失败"),
    CODE_20030(10420030, "该班级需要购课"),
    CODE_20031(10420031, "班级列表导出超过上限(10000条), 请修改查询条件, 分批次导出"),
    CODE_20032(10420032, "请分批次导出"),
    CODE_20033(10420033, "无导出数据"),
    CODE_20034(10420034, "老师信息不存在"),
    CODE_20035(10420035, "签到信息添加失败"),
    CODE_20036(10420036, "约课失败"),
    CODE_20037(10420037, "约课失败"),
    CODE_20038(10420038, "标签属性名称无有效字符"),
    CODE_20039(10420039, "标签属性名称不能超过10个字符"),
    CODE_20040(10420040, "视频信息不存在"),
    CODE_20041(10420041, "该章节已被添加, 请刷新页面后重试"),
    CODE_20042(10420042, "约课失败"),
    CODE_20043(10420043, "签到失败"),
    CODE_20044(10420044, "该章节下存在课节, 不可删除"),
    CODE_20045(10420045, "该章节下已存在该课节, 请刷新页面后重试"),
    CODE_20046(10420046, "该课程已有学员购课, 不可删除"),
    CODE_20047(10420047, "该课程下存在章节, 不可删除"),
    CODE_20048(10420048, "该课程不存在或已被删除, 请刷新页面后重试"),
    CODE_20049(10420049, "该章节不存在或已被删除, 请刷新页面后重试"),
    CODE_20050(10420050, "该课节不存在或已被删除, 请刷新页面后重试"),
    CODE_20051(10420051, "该标签不存在或已被删除, 请刷新页面后重试"),
    CODE_20052(10420052, "当前教室经纬度信息不存在"),
    CODE_20053(10420053, "当前日期不在班级上课日期范围内"),
    CODE_20054(10420054, "标签名不能超过10个字符"),
    CODE_20060(10420060, "标签分类名称不能为空"),
    CODE_20061(10420061, "标签分类名称不能超过10个字符"),
    CODE_20062(10420062, "标签最多只能添加50个"),
    CODE_20063(10420063, "标签名不能为空"),
    CODE_20064(10420064, "试卷不存在"),
    CODE_20065(10420065, "学员成绩不存在"),
    CODE_20066(10420066, "购课证书与申请证书不符"),
    CODE_20067(10420067, "购课证书信息不存在"),
    CODE_20068(10420068, "你的购课信息不能申请证书"),
    CODE_20069(10420069, "学员实操考试成绩不及格，不能申请证书"),
    CODE_20070(10420070, "学员理论考试成绩不及格，不能申请证书"),


    CODE_20100(10420100, "事件类型传参不正确"),
    // 学员政府补贴功能错误码  CODE_21000开始~CODE_22000结束 并以10421000错误码开始
    CODE_21000(10421000, "审核文件上传失败"),
    CODE_21001(10421001, "审核文件过大, Excel文件最大限制为1000行, 请上传小于等于1000行数据的文件"),
    CODE_21002(10421002, "学员补贴政府审核数据校验结果导出失败"),
    CODE_21003(10421003, "本次导入有效时间已过或不存在, 请重新导入"),
    CODE_21004(10421004, "不能导入空数据"),
    CODE_21005(10421005, "您本次导入有效数据为0, 或者导入有效时间已过, 请重新导入"),
    CODE_21006(10421006, "不支持的上传文件格式"),
    CODE_21007(10421007, "处理上传政府补贴课学员报名文件发生错误"),
    CODE_21008(10421008, "处理上传政府补贴课学员报名的表格格式与模板不匹配"),
    CODE_21009(10421009, "批量导入补贴课学员数据校验结果导出失败"),
    CODE_21010(10421010, "批量导出学员报名表失败"),
    CODE_21011(10421011, "身份证或者手机号重复"),
    CODE_21012(10421012, "姓名不能为空"),
    CODE_21013(10421013, "姓名只能包含中文字符"),
    CODE_21014(10421014, "姓名只能为2到4个字符"),
    CODE_21015(10421015, "身份证号码错误"),
    CODE_21016(10421016, "手机号码错误"),
    CODE_21017(10421017, "门店错误"),
    CODE_21018(10421018, "添加失败，本次可添加的数据为0"),
    CODE_21019(10421019, "处理上传政府审核文件发生错误"),
    CODE_21020(10421020, "处理上传政府审批模板的表格格式与模板不匹配"),
    CODE_21021(10421021, "上传数据条数大于1000条，请分批上传！"),
    CODE_21030(10421030, "文件导出失败, 请重试或联系系统管理员"),

    // 课程分类、课程视频、课程课件 CODE_22100开始~CODE_22400结束
    CODE_22100(10422100, "父级分类不存在"),
    CODE_22101(10422101, "状态值不存在"),
    CODE_22102(10422102, "分类不存在"),
    CODE_22103(10422103, "存在子分类，不能删除"),
    CODE_22104(10422104, "分类被视频或课件或课程使用，不能删除"),
    CODE_22105(10422105, "视频不存在"),
    CODE_22106(10422106, "课件不存在"),
    CODE_22107(10422107, "课件被其他资源使用，不能删除"),
    CODE_22108(10422108, "主分类数量超过限制"),
    CODE_22109(10422109, "子分类数量超过限制"),
    //3**** 外部服务异常
    CODE_30001(10430001, "调用UC服务异常"),
    CODE_30002(10430002, "调用OA系统服务异常"),
    CODE_30003(10430003, "调用外部服务异常"),
    CODE_30004(10430004, "获取LUA数据异常"),
    CODE_30005(10430005, "调用ZEUS服务异常"),
    CODE_30006(10430006, "调用商品中心服务异常"),
    CODE_30007(10430007, "调用HOURSEWORKER服务异常"),
    CODE_30008(10430008, "调用订单服务异常"),
    CODE_410(410, "用户未登录"),

    // 线上课-学员功能错误码
    CODE_31001(10431001, "学员id为空!"),
    CODE_31002(10431002, "该用户已开通此课程!"),

    // 题库管理错误码
    CODE_32001(10432001, "题库名称为空!"),
    CODE_32002(10432002, "题库描述为空!"),
    CODE_32003(10432003, "题库名称不能重复!"),
    CODE_32004(10432004, "题库id为空!"),
    CODE_32005(10432005, "题库不存在!"),

    // 题库管理错误码
    CODE_33001(10433001, "题目选项不能为空"),
    CODE_33002(10433002, "单选题必须有一个正确选项"),
    CODE_33003(10433003, "多选题必须有多个正确选项"),
    CODE_33004(10433004, "判断题必须只有一个正确选项"),
    CODE_33005(10433005, "题目不存在"),
    CODE_33006(10433006, "题目选项答案只能为Y或者N"),
    CODE_33007(10433007, "字数超限"),

    // 试卷
    CODE_34001(10434001, "试卷不存在"),


    //发证机构
    CODE_35001(10435001, "机构名不能重复"),
    CODE_35002(10435002, "机构下的证书类型不能为空"),
    CODE_35003(10435003, "机构下的证书类型不能重复"),
    CODE_35004(10435004, "证书机构不存在"),


    //证书
    CODE_36001(10436001, "该机构下已有此证书"),
    CODE_36002(10436002, "证书不存在"),


    //证书模板
    CODE_37001(10437001, "证书模板不存在"),

    //证书申报
    CODE_38001(10438001, "批量证书申报管理列表失败"),
    CODE_38002(10438002, "超出{0}条单次导出上限，请分批次导出"),
    CODE_38003(10438003, "证书申报不存在"),
    CODE_38004(10438004, "证书申报的相关学员信息不存在"),
    CODE_38005(10438005, "证书与机构不匹配"),
    ;

    public static WebResultCode getByCode(Integer code) {
        if (null != code) {
            for (WebResultCode e : values()) {
                if (e.code.equals(code)) {
                    return e;
                }
            }
        }
        return null;
    }





    private static final Pattern PATTERN = Pattern.compile("\\{0\\}|\\{[1-9][0-9]*\\}");

    private Integer code;
    private String msg;

    WebResultCode(Integer code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    public Integer getCode() {
        return code;
    }

    public String getMsg() {
        return msg;
    }

    @Override
    public String toString() {
        return code + " - " + msg;
    }
}
